MicrochipTech/oa-tc6-lib/examples/lwIP-SAM-D21-Curiosity-Nano/firmware/src/packs/ATSAMD21G17D_DFP/component/pm.h
/* -------- PM_APBCSEL : (PM Offset: 0x0B) (R/W 8) APBC Clock Select -------- */
#define PM_APBCSEL_RESETVALUE                 _UINT8_(0x00)                                        /*  (PM_APBCSEL) APBC Clock Select  Reset Value */

#define PM_APBCSEL_APBCDIV_Pos                _UINT8_(0)                                           /* (PM_APBCSEL) APBC Prescaler Selection Position */
#define PM_APBCSEL_APBCDIV_Msk                (_UINT8_(0x7) << PM_APBCSEL_APBCDIV_Pos)             /* (PM_APBCSEL) APBC Prescaler Selection Mask */
#define PM_APBCSEL_APBCDIV(value)             (PM_APBCSEL_APBCDIV_Msk & (_UINT8_(value) << PM_APBCSEL_APBCDIV_Pos)) /* Assigment of value for APBCDIV in the PM_APBCSEL register */
#define   PM_APBCSEL_APBCDIV_DIV1_Val         _UINT8_(0x0)                                         /* (PM_APBCSEL) Divide by 1  */
#define   PM_APBCSEL_APBCDIV_DIV2_Val         _UINT8_(0x1)                                         /* (PM_APBCSEL) Divide by 2  */
#define   PM_APBCSEL_APBCDIV_DIV4_Val         _UINT8_(0x2)                                         /* (PM_APBCSEL) Divide by 4  */
#define   PM_APBCSEL_APBCDIV_DIV8_Val         _UINT8_(0x3)                                         /* (PM_APBCSEL) Divide by 8  */
#define   PM_APBCSEL_APBCDIV_DIV16_Val        _UINT8_(0x4)                                         /* (PM_APBCSEL) Divide by 16  */
#define   PM_APBCSEL_APBCDIV_DIV32_Val        _UINT8_(0x5)                                         /* (PM_APBCSEL) Divide by 32  */
#define   PM_APBCSEL_APBCDIV_DIV64_Val        _UINT8_(0x6)                                         /* (PM_APBCSEL) Divide by 64  */
#define   PM_APBCSEL_APBCDIV_DIV128_Val       _UINT8_(0x7)                                         /* (PM_APBCSEL) Divide by 128  */
#define PM_APBCSEL_APBCDIV_DIV1               (PM_APBCSEL_APBCDIV_DIV1_Val << PM_APBCSEL_APBCDIV_Pos) /* (PM_APBCSEL) Divide by 1 Position  */
#define PM_APBCSEL_APBCDIV_DIV2               (PM_APBCSEL_APBCDIV_DIV2_Val << PM_APBCSEL_APBCDIV_Pos) /* (PM_APBCSEL) Divide by 2 Position  */
#define PM_APBCSEL_APBCDIV_DIV4               (PM_APBCSEL_APBCDIV_DIV4_Val << PM_APBCSEL_APBCDIV_Pos) /* (PM_APBCSEL) Divide by 4 Position  */
#define PM_APBCSEL_APBCDIV_DIV8               (PM_APBCSEL_APBCDIV_DIV8_Val << PM_APBCSEL_APBCDIV_Pos) /* (PM_APBCSEL) Divide by 8 Position  */
#define PM_APBCSEL_APBCDIV_DIV16              (PM_APBCSEL_APBCDIV_DIV16_Val << PM_APBCSEL_APBCDIV_Pos) /* (PM_APBCSEL) Divide by 16 Position  */
#define PM_APBCSEL_APBCDIV_DIV32              (PM_APBCSEL_APBCDIV_DIV32_Val << PM_APBCSEL_APBCDIV_Pos) /* (PM_APBCSEL) Divide by 32 Position  */
#define PM_APBCSEL_APBCDIV_DIV64              (PM_APBCSEL_APBCDIV_DIV64_Val << PM_APBCSEL_APBCDIV_Pos) /* (PM_APBCSEL) Divide by 64 Position  */
#define PM_APBCSEL_APBCDIV_DIV128             (PM_APBCSEL_APBCDIV_DIV128_Val << PM_APBCSEL_APBCDIV_Pos) /* (PM_APBCSEL) Divide by 128 Position  */
#define PM_APBCSEL_Msk                        _UINT8_(0x07)                                        /* (PM_APBCSEL) Register Mask  */


/* -------- PM_AHBMASK : (PM Offset: 0x14) (R/W 32) AHB Mask -------- */
#define PM_AHBMASK_RESETVALUE                 _UINT32_(0x7F)                                       /*  (PM_AHBMASK) AHB Mask  Reset Value */

#define PM_AHBMASK_HPB0_Pos                   _UINT32_(0)                                          /* (PM_AHBMASK) HPB0 AHB Clock Mask Position */
#define PM_AHBMASK_HPB0_Msk                   (_UINT32_(0x1) << PM_AHBMASK_HPB0_Pos)               /* (PM_AHBMASK) HPB0 AHB Clock Mask Mask */
#define PM_AHBMASK_HPB0(value)                (PM_AHBMASK_HPB0_Msk & (_UINT32_(value) << PM_AHBMASK_HPB0_Pos)) /* Assigment of value for HPB0 in the PM_AHBMASK register */
#define PM_AHBMASK_HPB1_Pos                   _UINT32_(1)                                          /* (PM_AHBMASK) HPB1 AHB Clock Mask Position */
#define PM_AHBMASK_HPB1_Msk                   (_UINT32_(0x1) << PM_AHBMASK_HPB1_Pos)               /* (PM_AHBMASK) HPB1 AHB Clock Mask Mask */
#define PM_AHBMASK_HPB1(value)                (PM_AHBMASK_HPB1_Msk & (_UINT32_(value) << PM_AHBMASK_HPB1_Pos)) /* Assigment of value for HPB1 in the PM_AHBMASK register */
#define PM_AHBMASK_HPB2_Pos                   _UINT32_(2)                                          /* (PM_AHBMASK) HPB2 AHB Clock Mask Position */
#define PM_AHBMASK_HPB2_Msk                   (_UINT32_(0x1) << PM_AHBMASK_HPB2_Pos)               /* (PM_AHBMASK) HPB2 AHB Clock Mask Mask */
#define PM_AHBMASK_HPB2(value)                (PM_AHBMASK_HPB2_Msk & (_UINT32_(value) << PM_AHBMASK_HPB2_Pos)) /* Assigment of value for HPB2 in the PM_AHBMASK register */
#define PM_AHBMASK_DSU_Pos                    _UINT32_(3)                                          /* (PM_AHBMASK) DSU AHB Clock Mask Position */
#define PM_AHBMASK_DSU_Msk                    (_UINT32_(0x1) << PM_AHBMASK_DSU_Pos)                /* (PM_AHBMASK) DSU AHB Clock Mask Mask */
#define PM_AHBMASK_DSU(value)                 (PM_AHBMASK_DSU_Msk & (_UINT32_(value) << PM_AHBMASK_DSU_Pos)) /* Assigment of value for DSU in the PM_AHBMASK register */
#define PM_AHBMASK_NVMCTRL_Pos                _UINT32_(4)                                          /* (PM_AHBMASK) NVMCTRL AHB Clock Mask Position */
#define PM_AHBMASK_NVMCTRL_Msk                (_UINT32_(0x1) << PM_AHBMASK_NVMCTRL_Pos)            /* (PM_AHBMASK) NVMCTRL AHB Clock Mask Mask */
#define PM_AHBMASK_NVMCTRL(value)             (PM_AHBMASK_NVMCTRL_Msk & (_UINT32_(value) << PM_AHBMASK_NVMCTRL_Pos)) /* Assigment of value for NVMCTRL in the PM_AHBMASK register */
#define PM_AHBMASK_DMAC_Pos                   _UINT32_(5)                                          /* (PM_AHBMASK) DMAC AHB Clock Mask Position */
#define PM_AHBMASK_DMAC_Msk                   (_UINT32_(0x1) << PM_AHBMASK_DMAC_Pos)               /* (PM_AHBMASK) DMAC AHB Clock Mask Mask */
#define PM_AHBMASK_DMAC(value)                (PM_AHBMASK_DMAC_Msk & (_UINT32_(value) << PM_AHBMASK_DMAC_Pos)) /* Assigment of value for DMAC in the PM_AHBMASK register */
#define PM_AHBMASK_USB_Pos                    _UINT32_(6)                                          /* (PM_AHBMASK) USB AHB Clock Mask Position */
#define PM_AHBMASK_USB_Msk                    (_UINT32_(0x1) << PM_AHBMASK_USB_Pos)                /* (PM_AHBMASK) USB AHB Clock Mask Mask */
#define PM_AHBMASK_USB(value)                 (PM_AHBMASK_USB_Msk & (_UINT32_(value) << PM_AHBMASK_USB_Pos)) /* Assigment of value for USB in the PM_AHBMASK register */
#define PM_AHBMASK_Msk                        _UINT32_(0x0000007F)                                 /* (PM_AHBMASK) Register Mask  */

#define PM_AHBMASK_HPB_Pos                    _UINT32_(0)                                          /* (PM_AHBMASK Position) HPBx AHB Clock Mask */
#define PM_AHBMASK_HPB_Msk                    (_UINT32_(0x7) << PM_AHBMASK_HPB_Pos)                /* (PM_AHBMASK Mask) HPB */
#define PM_AHBMASK_HPB(value)                 (PM_AHBMASK_HPB_Msk & (_UINT32_(value) << PM_AHBMASK_HPB_Pos)) 

